# <font color='blue'>Data Science Academy</font>
# <font color='blue'>Big Data Real-Time Analytics com Python e Spark</font>

## <font color='blue'>Capítulo 3 - Manipulação de Dados em Python com Pandas</font>

https://pandas.pydata.org/

In [1]:
# Versão da Linguagem Python
from platform import python_version
print('Versão da Linguagem Python Usada Neste Jupyter Notebook:', python_version())

Versão da Linguagem Python Usada Neste Jupyter Notebook: 3.9.7

In [2]:
# Para atualizar um pacote, execute o comando abaixo no terminal ou prompt de comando:
# pip install -U nome_pacote

# Para instalar a versão exata de um pacote, execute o comando abaixo no terminal ou prompt de comando:
#!pip install nome_pacote==versão_desejada

# Depois de instalar ou atualizar o pacote, reinicie o jupyter notebook.

# Instala o pacote watermark. 
# Esse pacote é usado para gravar as versões de outros pacotes usados neste jupyter notebook.
#!pip install -q -U watermark

In [3]:
# Importando o módulo Pandas
import pandas as pd

In [4]:
# Versões dos pacotes usados neste jupyter notebook
%reload_ext watermark
%watermark -a "Data Science Academy" --iversions

Author: Data Science Academy

pandas: 1.4.2

## Adição de Colunas e Índices Com e Sem Broadcasting

### Sem Broadcasting

In [5]:
# Carrega um arquivo do disco e armazena como um dataframe
df = pd.read_csv("dados/dataset1.csv")

In [6]:
df.head()

  club last_name first_name position  base_salary  guaranteed_compensation
0  ATL   Almiron     Miguel        M    1912500.0               2297000.00
1  ATL   Ambrose      Mikey        D      65625.0                 65625.00
2  ATL      Asad      Yamil        M     150000.0                150000.00
3  ATL     Bloom       Mark        D      99225.0                106573.89
4  ATL  Carleton     Andrew        F      65000.0                 77400.00

In [7]:
# Adicionando nova coluna
df['salario_final'] = 0

In [8]:
df.head()

,club,last_name,first_name,position,base_salary,guaranteed_compensation,salario_final
0,ATL,Almiron,Miguel,M,1912500.0,2297000.00,0
1,ATL,Ambrose,Mikey,D,65625.0,65625.00,0
2,ATL,Asad,Yamil,M,150000.0,150000.00,0
3,ATL,Bloom,Mark,D,99225.0,106573.89,0
4,ATL,Carleton,Andrew,F,65000.0,77400.00,0

In [9]:
# Preenchendo o valor da coluna a partir de outras variáveis
df['salario_final'] = df['base_salary'] + df['guaranteed_compensation']

In [10]:
df.head()

,club,last_name,first_name,position,base_salary,guaranteed_compensation,salario_final
0,ATL,Almiron,Miguel,M,1912500.0,2297000.00,4209500.00
1,ATL,Ambrose,Mikey,D,65625.0,65625.00,131250.00
2,ATL,Asad,Yamil,M,150000.0,150000.00,300000.00
3,ATL,Bloom,Mark,D,99225.0,106573.89,205798.89
4,ATL,Carleton,Andrew,F,65000.0,77400.00,142400.00

In [11]:
# Adicionando nova coluna
df.insert(0, column = "ID", value = range(1, 1 + len(df)))

In [12]:
df.head()

,ID,club,last_name,first_name,position,base_salary,guaranteed_compensation,salario_final
0,1,ATL,Almiron,Miguel,M,1912500.0,2297000.00,4209500.00
1,2,ATL,Ambrose,Mikey,D,65625.0,65625.00,131250.00
2,3,ATL,Asad,Yamil,M,150000.0,150000.00,300000.00
3,4,ATL,Bloom,Mark,D,99225.0,106573.89,205798.89
4,5,ATL,Carleton,Andrew,F,65000.0,77400.00,142400.00

In [13]:
df.tail()

,ID,club,last_name,first_name,position,base_salary,guaranteed_compensation,salario_final
610,611,VAN,Teibert,Russell,M,126500.0,194000.0,320500.0
611,612,VAN,Tornaghi,Paolo,GK,80000.0,80000.0,160000.0
612,613,VAN,Waston,Kendall,D,350000.0,368125.0,718125.0
613,614,NaN,NaN,NaN,NaN,NaN,NaN,NaN
614,615,VAN,Williams,Sheanon,D,175000.0,184000.0,359000.0

### Com Broadcasting

> Broadcasting é a propagação de uma operação ao longo do dataframe.

In [14]:
# Esta instrução não altera o dataframe original
df["base_salary"].add(5)

0      1912505.0
1        65630.0
2       150005.0
3        99230.0
4        65005.0
         ...
610     126505.0
611      80005.0
612     350005.0
613          NaN
614     175005.0
Name: base_salary, Length: 615, dtype: float64

In [15]:
df.base_salary.head()

0    1912500.0
1      65625.0
2     150000.0
3      99225.0
4      65000.0
Name: base_salary, dtype: float64

In [16]:
# Esta instrução altera o dataframe original
df["base_salary"] = df["base_salary"].add(5)

In [17]:
df.base_salary.head()

0    1912505.0
1      65630.0
2     150005.0
3      99230.0
4      65005.0
Name: base_salary, dtype: float64

In [18]:
df.head()

,ID,club,last_name,first_name,position,base_salary,guaranteed_compensation,salario_final
0,1,ATL,Almiron,Miguel,M,1912505.0,2297000.00,4209500.00
1,2,ATL,Ambrose,Mikey,D,65630.0,65625.00,131250.00
2,3,ATL,Asad,Yamil,M,150005.0,150000.00,300000.00
3,4,ATL,Bloom,Mark,D,99230.0,106573.89,205798.89
4,5,ATL,Carleton,Andrew,F,65005.0,77400.00,142400.00

In [19]:
# Adicionando nova coluna usando Broadcasting (convertendo de USD para EURO, neste exemplo)
df["base_salary_eur"] = df["base_salary"].mul(0.92)

In [20]:
df.head()

,ID,club,last_name,first_name,position,base_salary,guaranteed_compensation,salario_final,base_salary_eur
0,1,ATL,Almiron,Miguel,M,1912505.0,2297000.00,4209500.00,1759504.6
1,2,ATL,Ambrose,Mikey,D,65630.0,65625.00,131250.00,60379.6
2,3,ATL,Asad,Yamil,M,150005.0,150000.00,300000.00,138004.6
3,4,ATL,Bloom,Mark,D,99230.0,106573.89,205798.89,91291.6
4,5,ATL,Carleton,Andrew,F,65005.0,77400.00,142400.00,59804.6

In [21]:
# Drop de coluna (somente no resultado)
df.drop(columns = ['base_salary_eur'])

,ID,club,last_name,first_name,position,base_salary,guaranteed_compensation,salario_final
0,1,ATL,Almiron,Miguel,M,1912505.0,2297000.00,4209500.00
1,2,ATL,Ambrose,Mikey,D,65630.0,65625.00,131250.00
2,3,ATL,Asad,Yamil,M,150005.0,150000.00,300000.00
3,4,ATL,Bloom,Mark,D,99230.0,106573.89,205798.89
4,5,ATL,Carleton,Andrew,F,65005.0,77400.00,142400.00
...,...,...,...,...,...,...,...,...
610,611,VAN,Teibert,Russell,M,126505.0,194000.00,320500.00
611,612,VAN,Tornaghi,Paolo,GK,80005.0,80000.00,160000.00
612,613,VAN,Waston,Kendall,D,350005.0,368125.00,718125.00
613,614,NaN,NaN,NaN,NaN,NaN,NaN,NaN
614,615,VAN,Williams,Sheanon,D,175005.0,184000.00,359000.00

In [22]:
df.head()

,ID,club,last_name,first_name,position,base_salary,guaranteed_compensation,salario_final,base_salary_eur
0,1,ATL,Almiron,Miguel,M,1912505.0,2297000.00,4209500.00,1759504.6
1,2,ATL,Ambrose,Mikey,D,65630.0,65625.00,131250.00,60379.6
2,3,ATL,Asad,Yamil,M,150005.0,150000.00,300000.00,138004.6
3,4,ATL,Bloom,Mark,D,99230.0,106573.89,205798.89,91291.6
4,5,ATL,Carleton,Andrew,F,65005.0,77400.00,142400.00,59804.6

In [23]:
# Drop de coluna
df.drop(columns = ['base_salary_eur'], inplace = True)

In [24]:
df.head()

,ID,club,last_name,first_name,position,base_salary,guaranteed_compensation,salario_final
0,1,ATL,Almiron,Miguel,M,1912505.0,2297000.00,4209500.00
1,2,ATL,Ambrose,Mikey,D,65630.0,65625.00,131250.00
2,3,ATL,Asad,Yamil,M,150005.0,150000.00,300000.00
3,4,ATL,Bloom,Mark,D,99230.0,106573.89,205798.89
4,5,ATL,Carleton,Andrew,F,65005.0,77400.00,142400.00

In [25]:
# Adicionando nova coluna
df.insert(6, column = "base_salary_eur", value = df["base_salary"].mul(0.92))

In [26]:
df.head()

,ID,club,last_name,first_name,position,base_salary,base_salary_eur,guaranteed_compensation,salario_final
0,1,ATL,Almiron,Miguel,M,1912505.0,1759504.6,2297000.00,4209500.00
1,2,ATL,Ambrose,Mikey,D,65630.0,60379.6,65625.00,131250.00
2,3,ATL,Asad,Yamil,M,150005.0,138004.6,150000.00,300000.00
3,4,ATL,Bloom,Mark,D,99230.0,91291.6,106573.89,205798.89
4,5,ATL,Carleton,Andrew,F,65005.0,59804.6,77400.00,142400.00

In [27]:
df.rename(columns = {"base_salary": "base_salary_usd", 
                     "guaranteed_compensation": "guaranteed_compensation_usd",
                     "salario_final": "salario_final_usd"},
         inplace = True)

In [28]:
df.head()

,ID,club,last_name,first_name,position,base_salary_usd,base_salary_eur,guaranteed_compensation_usd,salario_final_usd
0,1,ATL,Almiron,Miguel,M,1912505.0,1759504.6,2297000.00,4209500.00
1,2,ATL,Ambrose,Mikey,D,65630.0,60379.6,65625.00,131250.00
2,3,ATL,Asad,Yamil,M,150005.0,138004.6,150000.00,300000.00
3,4,ATL,Bloom,Mark,D,99230.0,91291.6,106573.89,205798.89
4,5,ATL,Carleton,Andrew,F,65005.0,59804.6,77400.00,142400.00

In [29]:
# Convertemos a coluna ID em índice da tabela
df.set_index('ID', inplace = True)

In [30]:
df.head()

,club,last_name,first_name,position,base_salary_usd,base_salary_eur,guaranteed_compensation_usd,salario_final_usd
ID,,,,,,,,
1,ATL,Almiron,Miguel,M,1912505.0,1759504.6,2297000.00,4209500.00
2,ATL,Ambrose,Mikey,D,65630.0,60379.6,65625.00,131250.00
3,ATL,Asad,Yamil,M,150005.0,138004.6,150000.00,300000.00
4,ATL,Bloom,Mark,D,99230.0,91291.6,106573.89,205798.89
5,ATL,Carleton,Andrew,F,65005.0,59804.6,77400.00,142400.00

In [31]:
df.tail()

,club,last_name,first_name,position,base_salary_usd,base_salary_eur,guaranteed_compensation_usd,salario_final_usd
ID,,,,,,,,
611,VAN,Teibert,Russell,M,126505.0,116384.6,194000.0,320500.0
612,VAN,Tornaghi,Paolo,GK,80005.0,73604.6,80000.0,160000.0
613,VAN,Waston,Kendall,D,350005.0,322004.6,368125.0,718125.0
614,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
615,VAN,Williams,Sheanon,D,175005.0,161004.6,184000.0,359000.0

# Fim